Autodesk.Revit.DB.ImageTypeOptions.SetPath(System.String,System.Boolean)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location.
Additionally, indicate whether the path used by ImageType should be absolute or relative.
path:
The local file path that specifies the image to be used.
useRelativePath:
True if ImageType should use a relative path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.SetPath(System.String)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location. ImageType will respectively use an absolute or relative path.
path:
The local file path that specifies the image to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.#ctor(Autodesk.Revit.DB.ExternalResourceReference)
Constructs a new instance of the ImageTypeOptions object.
Remarks:
ImageTypeOptions uses an external resource reference to determine the local path that will be used
to open the image file. The operation to obtain the local path requires the resource to be loaded and is
performed at a later time when the local path is needed, for example, for validation. See also
LoadResource method of Autodesk.Revit.DB.IExternalResourceServer.
When the provided external resource reference contains a local file path, the information can include
an indication that the path should be treated as a relative path.
resourceReference:
An external resource reference to an image.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.#ctor(System.String,System.Boolean)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location.
This constructor saves an additional setting that indicates whether the path used by ImageType
should be absolute or relative.
path:
The local file path that specifies the image to be used.
useRelativePath:
True if ImageType should use a relative path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.#ctor(System.String)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location. ImageType will respectively use an absolute or relative path.
path:
The local file path that specifies the image to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions
Represents the options used in ImageType::Create(Document, ImageTypeOptions)
and ImageType.ReloadFrom(ImageTypeOptions) methods.
Remarks:
ImageTypeOptions determines how an image file is accessed for the purposes of validation and
creation of an ImageType. ImageTypeOptions can be set up to refer to a particular file
using either a string path or an external resource reference.
When a file is accessed with the help of an external server, it is likely that the server will
cache the file temporarily. ImageTypeOptions may refer to the cached copy of the file internally. For this
reason, ImageTypeOptions should be treated as a transient object whose purpose is to become an argument to
ImageType.Create(Document, ImageTypeOptions)
or ImageType.ReloadFrom(ImageTypeOptions).
An application should not create an ImageTypeOptions object and hold onto it for a long time.
Since:
2020